#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Experimental feature "module_variable_optional_attrs" is active

  on modules/cf-module/main.tf line 2, in terraform:
   2:   experiments = [module_variable_optional_attrs]

Experimental features are subject to breaking changes in future minor or
patch releases, based on feedback.

If you have feedback on the design of this feature, please open a GitHub
issue to discuss it.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.cf_record_module["radically.digital"].cloudflare_record.default["url3173.radi-885b379357126572477971a3963c8138"]: Refreshing state... [id=3f9935c4a24afcb335465625a92d288e]
module.cf_record_module["radically.digital"].cloudflare_record.default["google._doma-e03975d06d8ae9c7738df2a38e4e5a12"]: Refreshing state... [id=ec96bf1f0e44b86a4b12f84e3fefca51]
module.cf_record_module["radically.digital"].cloudflare_record.default["spec.radical-bb7cb060866a026a7c7e6366883eeed4"]: Refreshing state... [id=2e6983bbbeb1c1eb77e30eb25c573737]
module.cf_record_module["radically.digital"].cloudflare_record.default["radically.di-58bff8dacb413fcd25dd06a95586e460"]: Refreshing state... [id=7f8f93877ec862750ec73447a17fd8c9]
module.cf_record_module["radically.digital"].cloudflare_record.default["radically.di-118082cab31f934c791d5c345eca912e"]: Refreshing state... [id=93134df94e2e9555adacc76d3ee342c5]
module.cf_record_module["radically.digital"].cloudflare_record.default["s2._domainke-a4f8eb33aeb8b7db9ce1a4ba54d2f575"]: Refreshing state... [id=18620a1b12620679727a1e4c6649f064]
module.cf_record_module["radically.digital"].cloudflare_record.default["spec.radical-a97b27a0c98189bc95ff2d35de71c762"]: Refreshing state... [id=feefaf98e450b1388aa0282d6cdef169]
module.cf_record_module["radically.digital"].cloudflare_record.default["engineering.-a725e5d002c4ef9c222120e238fdd4cc"]: Refreshing state... [id=72bde4f165a5585e3881d2f77df495b9]
module.cf_record_module["radically.digital"].cloudflare_record.default["radically.di-22f69b0a7174d337675d21bfb897cc03"]: Refreshing state... [id=da86a0e75a41782262121f35e9903fc5]
module.cf_record_module["radically.digital"].cloudflare_record.default["www.radicall-e7b7ccbdb7abe36d8d1371fe356a8842"]: Refreshing state... [id=92a5bf7ef2e255147eda104ca922d16f]
module.cf_record_module["radically.digital"].cloudflare_record.default["_github-chal-be47244249ea7c55f6b164d5fc38d6f8"]: Refreshing state... [id=23c00fd958069b4b10ce9c9ede0767d9]
module.cf_record_module["radically.digital"].cloudflare_record.default["radically.di-f994680434bfb70f28dcc76f3592634e"]: Refreshing state... [id=968c9ce8226e0c26dd63b6c523c76b19]
module.cf_record_module["radically.digital"].cloudflare_record.default["spec.radical-db47fa1425efc56b71a19db6f4e55223"]: Refreshing state... [id=382990c3129e487ee8b16cccc9730a25]
module.cf_record_module["radically.digital"].cloudflare_record.default["watchdog.rad-bd656479a9985a1dd2d857adc5962d89"]: Refreshing state... [id=ae515dbb8352c924af74b204e468d206]
module.cf_record_module["radically.digital"].cloudflare_record.default["radically.di-09f25d138c363b289a90332a5e8e16e7"]: Refreshing state... [id=d78636516ec59ca17da83d10e9cf6be9]
module.cf_record_module["radically.digital"].cloudflare_record.default["default._bim-88762d676fb11167eae214f75e8b640e"]: Refreshing state... [id=c02d9dd99f0d9403f1a162c78a89083e]
module.cf_record_module["radically.digital"].cloudflare_record.default["radically.di-d271e1c0971328650ee932379cf59cd1"]: Refreshing state... [id=4629ba48ff2c1ca044adf3322abbd07d]
module.cf_record_module["radically.digital"].cloudflare_record.default["26552100.rad-885b379357126572477971a3963c8138"]: Refreshing state... [id=7766715d9d167fdb7eace5f16dcb6474]
module.cf_record_module["radically.digital"].cloudflare_record.default["radically.di-db1296156985eebb9b1fbbdc058b96bd"]: Refreshing state... [id=ecffe0f628de7b039b51f019e0550c18]
module.cf_record_module["radically.digital"].cloudflare_record.default["radically.di-f6b84e55631b695adb98154a6203727e"]: Refreshing state... [id=b3d5c2deaabc2940e523cc48b83c08a6]
module.cf_record_module["radically.digital"].cloudflare_record.default["em2060.radic-4fdb0e312f79a6da274efeb404070576"]: Refreshing state... [id=7f2c3821f0cad797130e02ad5aed863e]
module.cf_record_module["radically.digital"].cloudflare_record.default["radically.di-0b58c6944026745c19088e4aec4ff095"]: Refreshing state... [id=3b2a9ff2e9c0afd7e2d88e994b7dd65f]
module.cf_record_module["radically.digital"].cloudflare_record.default["readme.radic-f994680434bfb70f28dcc76f3592634e"]: Refreshing state... [id=0688b0221ab9b39da6912167781e07cb]
module.cf_record_module["radically.digital"].cloudflare_record.default["s1._domainke-e1f2c92cf2858627ee41cadc6b87358c"]: Refreshing state... [id=66ee4f4b716840ed497b4e338fc11f9c]
module.cf_record_module["radically.digital"].cloudflare_record.default["k2._domainke-98bab54ed2acb60309109e4a1364c856"]: Refreshing state... [id=f9d22ca5d0e9741af985addcf10892bb]
module.cf_record_module["radically.digital"].cloudflare_record.default["tests.radica-f994680434bfb70f28dcc76f3592634e"]: Refreshing state... [id=f437f95881906f795e469896722cd504]
module.cf_record_module["radically.digital"].cloudflare_record.default["radically.di-49ffd1c07047ba2379fb05cacd9c58e3"]: Refreshing state... [id=cc18a9d8e86848cb4892625cdbeb817b]
module.cf_record_module["radically.digital"].cloudflare_record.default["_dmarc-0325144cbbcaa04e8b4fcb3a74b1cbbc"]: Refreshing state... [id=d520d25c54c4b2670ea01ea176f639a9]
module.cf_record_module["radically.digital"].cloudflare_record.default["rsta-dev.rad-3ebd97d32658b7c8b4c65d9e38d33964"]: Refreshing state... [id=32963d1ac32c0799c474be88b2732768]
module.cf_record_module["radically.digital"].cloudflare_record.default["k3._domainke-7b0fa0a6e798d827acd71014f88b27b6"]: Refreshing state... [id=25a197b381499fcaa7af666ebc00f8aa]
module.cf_record_module["radically.digital"].cloudflare_record.default["watchdog.rad-ebd70e2e20d1245f13b70e310593eb74"]: Refreshing state... [id=9b1b2410f66e50d70587dcf6bbcac962]
module.cf_record_module["radically.digital"].cloudflare_record.default["watchdog.rad-28cc4d2b3a1e3702da5bee4a75730b89"]: Refreshing state... [id=577f487e3feb9e67ac34bda25d18381f]
module.cf_record_module["radically.digital"].cloudflare_record.default["poc-insights-07d46d0870e1002b9eacf7bd14cc70f7"]: Refreshing state... [id=454105b2aa8c6f8b8d36cac4a2f9ac49]
module.cf_record_module["radically.digital"].cloudflare_record.default["spec.radical-8ff1712392f7287260546bf575d80840"]: Refreshing state... [id=aab57e3d605dfdba4a51d0f063030911]
module.cf_record_module["radically.digital"].cloudflare_record.default["rsta-dev.rad-3a80a582f430dce1ac0e27d3dd0d52b0"]: Refreshing state... [id=11ba81cde4710e76256e4b13d9b5bbdb]
module.cf_record_module["radically.digital"].cloudflare_record.default["radically.di-337869508305f6ffbf2815f174c9d287"]: Refreshing state... [id=56f02144ddb470c267c21bf4712c3131]
module.cf_record_module["radically.digital"].cloudflare_record.default["watchdog.rad-c47cdd9089ed90236f1abe0971f9e389"]: Refreshing state... [id=f47fdac68f66f26610e6ed3d6fed536d]
module.cf_record_module["radically.digital"].cloudflare_record.default["radically.di-247c22b06e1804db74418c68fe8ae838"]: Refreshing state... [id=6a24b6493530d79b1498a08ccfb9cd47]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cf_record_module["radically.digital"].cloudflare_record.default["development.-f994680434bfb70f28dcc76f3592634e"] will be created
  + resource "cloudflare_record" "default" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "development.radically.digital"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "na-west1.surge.sh"
      + zone_id         = "dc2bb28469f7870cab9d8f715ffdce15"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Experimental feature "module_variable_optional_attrs" is active

  on modules/cf-module/main.tf line 2, in terraform:
   2:   experiments = [module_variable_optional_attrs]

Experimental features are subject to breaking changes in future minor or
patch releases, based on feedback.

If you have feedback on the design of this feature, please open a GitHub
issue to discuss it.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @DanieleBaelde-RAD, Action: `pull_request`, Working Directory: ``, Workflow: `Run Action`*